GopalSaraf/Practicals/PSDL/include/proc/pic18lf26j53.inc
// Register: PPSCON
#define PPSCON PPSCON
PPSCON                                   equ 0EBFh
// bitfield definitions
PPSCON_IOLOCK_POSN                       equ 0000h
PPSCON_IOLOCK_POSITION                   equ 0000h
PPSCON_IOLOCK_SIZE                       equ 0001h
PPSCON_IOLOCK_LENGTH                     equ 0001h
PPSCON_IOLOCK_MASK                       equ 0001h

// Register: RPOR0
#define RPOR0 RPOR0
RPOR0                                    equ 0EC0h

// Register: RPOR1
#define RPOR1 RPOR1
RPOR1                                    equ 0EC1h

// Register: RPOR2
#define RPOR2 RPOR2
RPOR2                                    equ 0EC2h

// Register: RPOR3
#define RPOR3 RPOR3
RPOR3                                    equ 0EC3h

// Register: RPOR4
#define RPOR4 RPOR4
RPOR4                                    equ 0EC4h

// Register: RPOR5
#define RPOR5 RPOR5
RPOR5                                    equ 0EC5h

// Register: RPOR6
#define RPOR6 RPOR6
RPOR6                                    equ 0EC6h

// Register: RPOR7
#define RPOR7 RPOR7
RPOR7                                    equ 0EC7h

// Register: RPOR8
#define RPOR8 RPOR8
RPOR8                                    equ 0EC8h

// Register: RPOR9
#define RPOR9 RPOR9
RPOR9                                    equ 0EC9h

// Register: RPOR10
#define RPOR10 RPOR10
RPOR10                                   equ 0ECAh

// Register: RPOR11
#define RPOR11 RPOR11
RPOR11                                   equ 0ECBh

// Register: RPOR12
#define RPOR12 RPOR12
RPOR12                                   equ 0ECCh

// Register: RPOR13
#define RPOR13 RPOR13
RPOR13                                   equ 0ECDh

// Register: RPOR17
#define RPOR17 RPOR17
RPOR17                                   equ 0ED1h

// Register: RPOR18
#define RPOR18 RPOR18
RPOR18                                   equ 0ED2h

// Register: RPINR1
#define RPINR1 RPINR1
RPINR1                                   equ 0EE1h

// Register: RPINR2
#define RPINR2 RPINR2
RPINR2                                   equ 0EE2h

// Register: RPINR3
#define RPINR3 RPINR3
RPINR3                                   equ 0EE3h

// Register: RPINR4
#define RPINR4 RPINR4
RPINR4                                   equ 0EE4h

// Register: RPINR6
#define RPINR6 RPINR6
RPINR6                                   equ 0EE6h

// Register: RPINR15
#define RPINR15 RPINR15
RPINR15                                  equ 0EE7h

// Register: RPINR7
#define RPINR7 RPINR7
RPINR7                                   equ 0EE8h

// Register: RPINR8
#define RPINR8 RPINR8
RPINR8                                   equ 0EE9h

// Register: RPINR9
#define RPINR9 RPINR9
RPINR9                                   equ 0EEAh

// Register: RPINR12
#define RPINR12 RPINR12
RPINR12                                  equ 0EF2h

// Register: RPINR13
#define RPINR13 RPINR13
RPINR13                                  equ 0EF3h

// Register: RPINR14
#define RPINR14 RPINR14
RPINR14                                  equ 0EF4h

// Register: RPINR16
#define RPINR16 RPINR16
RPINR16                                  equ 0EF7h

// Register: RPINR17
#define RPINR17 RPINR17
RPINR17                                  equ 0EF8h

// Register: RPINR21
#define RPINR21 RPINR21
RPINR21                                  equ 0EFCh

// Register: RPINR22
#define RPINR22 RPINR22
RPINR22                                  equ 0EFDh

// Register: RPINR23
#define RPINR23 RPINR23
RPINR23                                  equ 0EFEh

// Register: RPINR24
#define RPINR24 RPINR24
RPINR24                                  equ 0EFFh

// Register: CCP10CON
#define CCP10CON CCP10CON
CCP10CON                                 equ 0F00h
// bitfield definitions
CCP10CON_CCP10M_POSN                     equ 0000h
CCP10CON_CCP10M_POSITION                 equ 0000h
CCP10CON_CCP10M_SIZE                     equ 0004h
CCP10CON_CCP10M_LENGTH                   equ 0004h
CCP10CON_CCP10M_MASK                     equ 000Fh
CCP10CON_DC10B_POSN                      equ 0004h
CCP10CON_DC10B_POSITION                  equ 0004h
CCP10CON_DC10B_SIZE                      equ 0002h
CCP10CON_DC10B_LENGTH                    equ 0002h
CCP10CON_DC10B_MASK                      equ 0030h
CCP10CON_CCP10M0_POSN                    equ 0000h
CCP10CON_CCP10M0_POSITION                equ 0000h
CCP10CON_CCP10M0_SIZE                    equ 0001h
CCP10CON_CCP10M0_LENGTH                  equ 0001h
CCP10CON_CCP10M0_MASK                    equ 0001h
CCP10CON_CCP10M1_POSN                    equ 0001h
CCP10CON_CCP10M1_POSITION                equ 0001h
CCP10CON_CCP10M1_SIZE                    equ 0001h
CCP10CON_CCP10M1_LENGTH                  equ 0001h
CCP10CON_CCP10M1_MASK                    equ 0002h
CCP10CON_CCP10M2_POSN                    equ 0002h
CCP10CON_CCP10M2_POSITION                equ 0002h
CCP10CON_CCP10M2_SIZE                    equ 0001h
CCP10CON_CCP10M2_LENGTH                  equ 0001h
CCP10CON_CCP10M2_MASK                    equ 0004h
CCP10CON_CCP10M3_POSN                    equ 0003h
CCP10CON_CCP10M3_POSITION                equ 0003h
CCP10CON_CCP10M3_SIZE                    equ 0001h
CCP10CON_CCP10M3_LENGTH                  equ 0001h
CCP10CON_CCP10M3_MASK                    equ 0008h
CCP10CON_DC10B0_POSN                     equ 0004h
CCP10CON_DC10B0_POSITION                 equ 0004h
CCP10CON_DC10B0_SIZE                     equ 0001h
CCP10CON_DC10B0_LENGTH                   equ 0001h
CCP10CON_DC10B0_MASK                     equ 0010h
CCP10CON_DC10B1_POSN                     equ 0005h
CCP10CON_DC10B1_POSITION                 equ 0005h
CCP10CON_DC10B1_SIZE                     equ 0001h
CCP10CON_DC10B1_LENGTH                   equ 0001h
CCP10CON_DC10B1_MASK                     equ 0020h

// Register: CCPR10L
#define CCPR10L CCPR10L
CCPR10L                                  equ 0F01h
// bitfield definitions
CCPR10L_CCPR10L_POSN                     equ 0000h
CCPR10L_CCPR10L_POSITION                 equ 0000h
CCPR10L_CCPR10L_SIZE                     equ 0008h
CCPR10L_CCPR10L_LENGTH                   equ 0008h
CCPR10L_CCPR10L_MASK                     equ 00FFh

