GopalSaraf/Practicals/PSDL/include/proc/pic18lf26j53.inc
// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 0F98h
// bitfield definitions
PIR5_TMR1GIF_POSN                        equ 0000h
PIR5_TMR1GIF_POSITION                    equ 0000h
PIR5_TMR1GIF_SIZE                        equ 0001h
PIR5_TMR1GIF_LENGTH                      equ 0001h
PIR5_TMR1GIF_MASK                        equ 0001h
PIR5_TMR5GIF_POSN                        equ 0001h
PIR5_TMR5GIF_POSITION                    equ 0001h
PIR5_TMR5GIF_SIZE                        equ 0001h
PIR5_TMR5GIF_LENGTH                      equ 0001h
PIR5_TMR5GIF_MASK                        equ 0002h
PIR5_TMR5IF_POSN                         equ 0002h
PIR5_TMR5IF_POSITION                     equ 0002h
PIR5_TMR5IF_SIZE                         equ 0001h
PIR5_TMR5IF_LENGTH                       equ 0001h
PIR5_TMR5IF_MASK                         equ 0004h
PIR5_TMR6IF_POSN                         equ 0003h
PIR5_TMR6IF_POSITION                     equ 0003h
PIR5_TMR6IF_SIZE                         equ 0001h
PIR5_TMR6IF_LENGTH                       equ 0001h
PIR5_TMR6IF_MASK                         equ 0008h
PIR5_TMR8IF_POSN                         equ 0004h
PIR5_TMR8IF_POSITION                     equ 0004h
PIR5_TMR8IF_SIZE                         equ 0001h
PIR5_TMR8IF_LENGTH                       equ 0001h
PIR5_TMR8IF_MASK                         equ 0010h
PIR5_CM3IF_POSN                          equ 0005h
PIR5_CM3IF_POSITION                      equ 0005h
PIR5_CM3IF_SIZE                          equ 0001h
PIR5_CM3IF_LENGTH                        equ 0001h
PIR5_CM3IF_MASK                          equ 0020h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 0F99h
// bitfield definitions
IPR5_TMR1GIP_POSN                        equ 0000h
IPR5_TMR1GIP_POSITION                    equ 0000h
IPR5_TMR1GIP_SIZE                        equ 0001h
IPR5_TMR1GIP_LENGTH                      equ 0001h
IPR5_TMR1GIP_MASK                        equ 0001h
IPR5_TMR5GIP_POSN                        equ 0001h
IPR5_TMR5GIP_POSITION                    equ 0001h
IPR5_TMR5GIP_SIZE                        equ 0001h
IPR5_TMR5GIP_LENGTH                      equ 0001h
IPR5_TMR5GIP_MASK                        equ 0002h
IPR5_TMR5IP_POSN                         equ 0002h
IPR5_TMR5IP_POSITION                     equ 0002h
IPR5_TMR5IP_SIZE                         equ 0001h
IPR5_TMR5IP_LENGTH                       equ 0001h
IPR5_TMR5IP_MASK                         equ 0004h
IPR5_TMR6IP_POSN                         equ 0003h
IPR5_TMR6IP_POSITION                     equ 0003h
IPR5_TMR6IP_SIZE                         equ 0001h
IPR5_TMR6IP_LENGTH                       equ 0001h
IPR5_TMR6IP_MASK                         equ 0008h
IPR5_TMR8IP_POSN                         equ 0004h
IPR5_TMR8IP_POSITION                     equ 0004h
IPR5_TMR8IP_SIZE                         equ 0001h
IPR5_TMR8IP_LENGTH                       equ 0001h
IPR5_TMR8IP_MASK                         equ 0010h
IPR5_CM3IP_POSN                          equ 0005h
IPR5_CM3IP_POSITION                      equ 0005h
IPR5_CM3IP_SIZE                          equ 0001h
IPR5_CM3IP_LENGTH                        equ 0001h
IPR5_CM3IP_MASK                          equ 0020h
IPR5_CCH05_POSN                          equ 0000h
IPR5_CCH05_POSITION                      equ 0000h
IPR5_CCH05_SIZE                          equ 0001h
IPR5_CCH05_LENGTH                        equ 0001h
IPR5_CCH05_MASK                          equ 0001h
IPR5_CCH15_POSN                          equ 0001h
IPR5_CCH15_POSITION                      equ 0001h
IPR5_CCH15_SIZE                          equ 0001h
IPR5_CCH15_LENGTH                        equ 0001h
IPR5_CCH15_MASK                          equ 0002h
IPR5_EVPOL05_POSN                        equ 0003h
IPR5_EVPOL05_POSITION                    equ 0003h
IPR5_EVPOL05_SIZE                        equ 0001h
IPR5_EVPOL05_LENGTH                      equ 0001h
IPR5_EVPOL05_MASK                        equ 0008h
IPR5_EVPOL15_POSN                        equ 0004h
IPR5_EVPOL15_POSITION                    equ 0004h
IPR5_EVPOL15_SIZE                        equ 0001h
IPR5_EVPOL15_LENGTH                      equ 0001h
IPR5_EVPOL15_MASK                        equ 0010h

// Register: T1GCON
#define T1GCON T1GCON
T1GCON                                   equ 0F9Ah
// bitfield definitions
T1GCON_T1GGO_NOT_T1DONE_POSN             equ 0003h
T1GCON_T1GGO_NOT_T1DONE_POSITION         equ 0003h
T1GCON_T1GGO_NOT_T1DONE_SIZE             equ 0001h
T1GCON_T1GGO_NOT_T1DONE_LENGTH           equ 0001h
T1GCON_T1GGO_NOT_T1DONE_MASK             equ 0008h
T1GCON_T1GSS0_POSN                       equ 0000h
T1GCON_T1GSS0_POSITION                   equ 0000h
T1GCON_T1GSS0_SIZE                       equ 0001h
T1GCON_T1GSS0_LENGTH                     equ 0001h
T1GCON_T1GSS0_MASK                       equ 0001h
T1GCON_T1GSS1_POSN                       equ 0001h
T1GCON_T1GSS1_POSITION                   equ 0001h
T1GCON_T1GSS1_SIZE                       equ 0001h
T1GCON_T1GSS1_LENGTH                     equ 0001h
T1GCON_T1GSS1_MASK                       equ 0002h
T1GCON_T1GVAL_POSN                       equ 0002h
T1GCON_T1GVAL_POSITION                   equ 0002h
T1GCON_T1GVAL_SIZE                       equ 0001h
T1GCON_T1GVAL_LENGTH                     equ 0001h
T1GCON_T1GVAL_MASK                       equ 0004h
T1GCON_T1GGO_nT1DONE_POSN                equ 0003h
T1GCON_T1GGO_nT1DONE_POSITION            equ 0003h
T1GCON_T1GGO_nT1DONE_SIZE                equ 0001h
T1GCON_T1GGO_nT1DONE_LENGTH              equ 0001h
T1GCON_T1GGO_nT1DONE_MASK                equ 0008h
T1GCON_T1GSPM_POSN                       equ 0004h
T1GCON_T1GSPM_POSITION                   equ 0004h
T1GCON_T1GSPM_SIZE                       equ 0001h
T1GCON_T1GSPM_LENGTH                     equ 0001h
T1GCON_T1GSPM_MASK                       equ 0010h
T1GCON_T1GTM_POSN                        equ 0005h
T1GCON_T1GTM_POSITION                    equ 0005h
T1GCON_T1GTM_SIZE                        equ 0001h
T1GCON_T1GTM_LENGTH                      equ 0001h
T1GCON_T1GTM_MASK                        equ 0020h
T1GCON_T1GPOL_POSN                       equ 0006h
T1GCON_T1GPOL_POSITION                   equ 0006h
T1GCON_T1GPOL_SIZE                       equ 0001h
T1GCON_T1GPOL_LENGTH                     equ 0001h
T1GCON_T1GPOL_MASK                       equ 0040h
T1GCON_TMR1GE_POSN                       equ 0007h
T1GCON_TMR1GE_POSITION                   equ 0007h
T1GCON_TMR1GE_SIZE                       equ 0001h
T1GCON_TMR1GE_LENGTH                     equ 0001h
T1GCON_TMR1GE_MASK                       equ 0080h
T1GCON_T1GGO_POSN                        equ 0003h
T1GCON_T1GGO_POSITION                    equ 0003h
T1GCON_T1GGO_SIZE                        equ 0001h
T1GCON_T1GGO_LENGTH                      equ 0001h
T1GCON_T1GGO_MASK                        equ 0008h
T1GCON_NOT_T1DONE_POSN                   equ 0003h
T1GCON_NOT_T1DONE_POSITION               equ 0003h
T1GCON_NOT_T1DONE_SIZE                   equ 0001h
T1GCON_NOT_T1DONE_LENGTH                 equ 0001h
T1GCON_NOT_T1DONE_MASK                   equ 0008h
T1GCON_nT1DONE_POSN                      equ 0003h
T1GCON_nT1DONE_POSITION                  equ 0003h
T1GCON_nT1DONE_SIZE                      equ 0001h
T1GCON_nT1DONE_LENGTH                    equ 0001h
T1GCON_nT1DONE_MASK                      equ 0008h
T1GCON_T1DONE_POSN                       equ 0003h
T1GCON_T1DONE_POSITION                   equ 0003h
T1GCON_T1DONE_SIZE                       equ 0001h
T1GCON_T1DONE_LENGTH                     equ 0001h
T1GCON_T1DONE_MASK                       equ 0008h

